# Columnas

In [1]:
import pandas as pd

In [23]:
empresas= {'Empresas':['Empresa A','Empresa B','Empresa C','Empresa D'],
            'Ventas':[1500000,2000000,1234000,100000],
            'Costos':[600000,543678,235453,21464],
            'Ciudad':['Buenos Aires','Los Angeles','México','Miami'],
            'Piezas':[500,1234,6542,2344]}

In [24]:
df=pd.DataFrame(empresas)
df

    Empresas   Ventas  Costos        Ciudad  Piezas
0  Empresa A  1500000  600000  Buenos Aires     500
1  Empresa B  2000000  543678   Los Angeles    1234
2  Empresa C  1234000  235453        México    6542
3  Empresa D   100000   21464         Miami    2344

In [25]:
df.columns

Index(['Empresas', 'Ventas', 'Costos', 'Ciudad', 'Piezas'], dtype='object')

In [26]:
# Eligiendo columnas
df['Empresas']

0    Empresa A
1    Empresa B
2    Empresa C
3    Empresa D
Name: Empresas, dtype: object

In [27]:
df[['Empresas','Ventas']]

    Empresas   Ventas
0  Empresa A  1500000
1  Empresa B  2000000
2  Empresa C  1234000
3  Empresa D   100000

### iloc

In [28]:
df.iloc[:,0]

0    Empresa A
1    Empresa B
2    Empresa C
3    Empresa D
Name: Empresas, dtype: object

In [29]:
df.iloc[:,2]

0    600000
1    543678
2    235453
3     21464
Name: Costos, dtype: int64

In [30]:
df.iloc[:,:]

    Empresas   Ventas  Costos        Ciudad  Piezas
0  Empresa A  1500000  600000  Buenos Aires     500
1  Empresa B  2000000  543678   Los Angeles    1234
2  Empresa C  1234000  235453        México    6542
3  Empresa D   100000   21464         Miami    2344

In [31]:
df.iloc[:,[0,3,4]]

    Empresas        Ciudad  Piezas
0  Empresa A  Buenos Aires     500
1  Empresa B   Los Angeles    1234
2  Empresa C        México    6542
3  Empresa D         Miami    2344

### loc

In [32]:
df.loc[:,['Empresas','Ventas']]

    Empresas   Ventas
0  Empresa A  1500000
1  Empresa B  2000000
2  Empresa C  1234000
3  Empresa D   100000

In [33]:
df.loc[:,['Empresas','Piezas']]

    Empresas  Piezas
0  Empresa A     500
1  Empresa B    1234
2  Empresa C    6542
3  Empresa D    2344

### Agregar y borrar columnas

In [12]:
df

    Empresas   Ventas  Costos        Ciudad  Piezas
0  Empresa A  1500000  600000  Buenos Aires     500
1  Empresa B  2000000  543678   Los Angeles    1234
2  Empresa C  1234000  235453        México    6542
3  Empresa D   100000   21464         Miami    2344

In [13]:
# Crear nueva columna
df['Precio Promedio']=df['Ventas']/df['Piezas']

In [14]:
df

    Empresas   Ventas  Costos        Ciudad  Piezas  Precio Promedio
0  Empresa A  1500000  600000  Buenos Aires     500      3000.000000
1  Empresa B  2000000  543678   Los Angeles    1234      1620.745543
2  Empresa C  1234000  235453        México    6542       188.627331
3  Empresa D   100000   21464         Miami    2344        42.662116

In [15]:
# Borrar columnas con método drop
#axis=1 para columnas y 0 para filas
df.drop('Precio Promedio',axis=1)

    Empresas   Ventas  Costos        Ciudad  Piezas
0  Empresa A  1500000  600000  Buenos Aires     500
1  Empresa B  2000000  543678   Los Angeles    1234
2  Empresa C  1234000  235453        México    6542
3  Empresa D   100000   21464         Miami    2344

In [16]:
df

    Empresas   Ventas  Costos        Ciudad  Piezas  Precio Promedio
0  Empresa A  1500000  600000  Buenos Aires     500      3000.000000
1  Empresa B  2000000  543678   Los Angeles    1234      1620.745543
2  Empresa C  1234000  235453        México    6542       188.627331
3  Empresa D   100000   21464         Miami    2344        42.662116

In [17]:
df.drop('Precio Promedio',axis=1, inplace=True)

In [18]:
df

    Empresas   Ventas  Costos        Ciudad  Piezas
0  Empresa A  1500000  600000  Buenos Aires     500
1  Empresa B  2000000  543678   Los Angeles    1234
2  Empresa C  1234000  235453        México    6542
3  Empresa D   100000   21464         Miami    2344

In [19]:
#Manera alternativa de borrar columnas
df=df[['Empresas','Ventas']]

In [20]:
df

    Empresas   Ventas
0  Empresa A  1500000
1  Empresa B  2000000
2  Empresa C  1234000
3  Empresa D   100000

# Filas

In [34]:
empresas= {'Empresas':['Empresa A','Empresa B','Empresa C','Empresa D'],
            'Ventas':[1500000,2000000,1234000,100000],
            'Costos':[600000,543678,235453,21464],
            'Ciudad':['Buenos Aires','Los Angeles','México','Miami'],
            'Piezas':[500,1234,6542,2344]}

In [35]:
df=pd.DataFrame(empresas)
df

    Empresas   Ventas  Costos        Ciudad  Piezas
0  Empresa A  1500000  600000  Buenos Aires     500
1  Empresa B  2000000  543678   Los Angeles    1234
2  Empresa C  1234000  235453        México    6542
3  Empresa D   100000   21464         Miami    2344

In [36]:
df.iloc[:,:]

    Empresas   Ventas  Costos        Ciudad  Piezas
0  Empresa A  1500000  600000  Buenos Aires     500
1  Empresa B  2000000  543678   Los Angeles    1234
2  Empresa C  1234000  235453        México    6542
3  Empresa D   100000   21464         Miami    2344

In [37]:
# El último número no lo toma en cuenta
df.iloc[0:3,:]

    Empresas   Ventas  Costos        Ciudad  Piezas
0  Empresa A  1500000  600000  Buenos Aires     500
1  Empresa B  2000000  543678   Los Angeles    1234
2  Empresa C  1234000  235453        México    6542

In [38]:
df.iloc[0:2,:]

    Empresas   Ventas  Costos        Ciudad  Piezas
0  Empresa A  1500000  600000  Buenos Aires     500
1  Empresa B  2000000  543678   Los Angeles    1234

### Usando Loc

In [39]:
df

    Empresas   Ventas  Costos        Ciudad  Piezas
0  Empresa A  1500000  600000  Buenos Aires     500
1  Empresa B  2000000  543678   Los Angeles    1234
2  Empresa C  1234000  235453        México    6542
3  Empresa D   100000   21464         Miami    2344

In [41]:
df.set_index(df['Empresas'],inplace=True)

In [42]:
df

            Empresas   Ventas  Costos        Ciudad  Piezas
Empresas
Empresa A  Empresa A  1500000  600000  Buenos Aires     500
Empresa B  Empresa B  2000000  543678   Los Angeles    1234
Empresa C  Empresa C  1234000  235453        México    6542
Empresa D  Empresa D   100000   21464         Miami    2344

In [43]:
df.loc['Empresa A',:]

Empresas       Empresa A
Ventas           1500000
Costos            600000
Ciudad      Buenos Aires
Piezas               500
Name: Empresa A, dtype: object

In [44]:
df.loc[['Empresa A','Empresa B'],:]

            Empresas   Ventas  Costos        Ciudad  Piezas
Empresas
Empresa A  Empresa A  1500000  600000  Buenos Aires     500
Empresa B  Empresa B  2000000  543678   Los Angeles    1234

### Agregar y borrar filas

In [60]:
import numpy as np

In [61]:
empresas= {'Empresas':['Empresa A','Empresa B','Empresa C','Empresa D'],
            'Ventas':[1500000,2000000,1234000,100000],
            'Costos':[600000,543678,235453,21464],
            'Ciudad':['Buenos Aires','Los Angeles','México',np.nan],
            'Piezas':[500,1234,6542,np.nan]}

In [62]:
df=pd.DataFrame(empresas)
df

    Empresas   Ventas  Costos        Ciudad  Piezas
0  Empresa A  1500000  600000  Buenos Aires   500.0
1  Empresa B  2000000  543678   Los Angeles  1234.0
2  Empresa C  1234000  235453        México  6542.0
3  Empresa D   100000   21464           NaN     NaN

In [63]:
#Borrar fila con Drop Method
df=df.dropna(axis=0,how='any')

In [64]:
df.head()

    Empresas   Ventas  Costos        Ciudad  Piezas
0  Empresa A  1500000  600000  Buenos Aires   500.0
1  Empresa B  2000000  543678   Los Angeles  1234.0
2  Empresa C  1234000  235453        México  6542.0

In [67]:
empresas2= {'Empresas':['Empresa E'],
            'Ventas':[500000],
            'Costos':[621464],
            'Ciudad':['NY'],
            'Piezas':[500]}

In [68]:
df2=pd.DataFrame(empresas2)

In [70]:
df_nueva=df.append(df2)

In [71]:
df_nueva

    Empresas   Ventas  Costos        Ciudad  Piezas
0  Empresa A  1500000  600000  Buenos Aires   500.0
1  Empresa B  2000000  543678   Los Angeles  1234.0
2  Empresa C  1234000  235453        México  6542.0
0  Empresa E   500000  621464            NY   500.0